renesas/ra-fsp-examples/application_projects/lpm_applications/RA6/Clock_change_and_lpm_EK_RA6M3/e2studio/src/lpm_app.c
      case ST_LOCO_NORM:
    	  return "ST_LOCO_NORM";

      case ST_SOSC_NORM:
    	  return "ST_SOSC_NORM";

      case ST_CLK_NORM:
    	  return "ST_CLK_NORM";

      default:
    	  return "UNKNOWN";
    }
	return "UNKNOWN";
}

/**********************************************************************************************************************
 * @brief       This function converts the FSM internal clock states into short string format for user display purpose.
 * @param[IN]   clock state
 * @retval      returns the equivalent string for the clock state.
 * @retval      Any Other state returns "UNKNOWN"
 **********************************************************************************************************************/
char *clk_state_to_user_string(clk_state_t cstate)
{
	switch(cstate)
    {
      case ST_MOSC_NORM:
    	  return "MOSC";

      case ST_HOCO_NORM:
    	  return "HOCO";

      case ST_MOCO_NORM:
    	  return "MOCO";

      case ST_LOCO_NORM:
    	  return "LOCO";

      case ST_SOSC_NORM:
    	  return "SOSC";

      case ST_CLK_NORM:
    	  return "MOSC";

      default:
    	  return "UNKNOWN";
    }
	return "UNKNOWN";
}

/**********************************************************************************************************************
 * @brief       This function changes the System Clock divider  settings as applicable to the MCU and various peripherals
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void preffered_ra6m_clock_setting(cgc_pll_cfg_t *lnew_clk, cgc_clocks_cfg_t *lsys_clk_cfg)
{
	lnew_clk->divider = CGC_PLL_DIV_2;
	lnew_clk->multiplier = CGC_PLL_MUL_20_0;

	lsys_clk_cfg->system_clock = CGC_CLOCK_MAIN_OSC;

	lsys_clk_cfg->pll_cfg.divider = CGC_PLL_DIV_2;
	lsys_clk_cfg->pll_cfg.source_clock = CGC_CLOCK_MAIN_OSC;
	lsys_clk_cfg->pll_cfg.multiplier = CGC_PLL_MUL_20_0;

	lsys_clk_cfg->divider_cfg.iclk_div = CGC_SYS_CLOCK_DIV_2;
	lsys_clk_cfg->divider_cfg.bclk_div = CGC_SYS_CLOCK_DIV_2;
	lsys_clk_cfg->divider_cfg.fclk_div = CGC_SYS_CLOCK_DIV_4;
	lsys_clk_cfg->divider_cfg.pclka_div = CGC_SYS_CLOCK_DIV_2;
	lsys_clk_cfg->divider_cfg.pclkb_div = CGC_SYS_CLOCK_DIV_4;
	lsys_clk_cfg->divider_cfg.pclkc_div = CGC_SYS_CLOCK_DIV_4;
	lsys_clk_cfg->divider_cfg.pclkd_div = CGC_SYS_CLOCK_DIV_2;
}
/**********************************************************************************************************************
 * @brief       This function changes the System Clock to the desired clock from the User Input.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void change_system_clock(void)
{
	fsp_err_t err = FSP_SUCCESS;
	cgc_divider_cfg_t sys_divider_cf = { RESET_VALUE };
	cgc_clock_t  sys_clock_source    = { RESET_VALUE };
	cgc_clocks_cfg_t sys_clk_cfg     = { RESET_VALUE };
	cgc_pll_cfg_t new_clk            = { RESET_VALUE };

#if defined (BOARD_RA6M3_EK) || defined (BOARD_RA6M3G_EK) || defined (BOARD_RA6M2_EK) || defined (BOARD_RA6M1_EK)

	preffered_ra6m_clock_setting(&new_clk, &sys_clk_cfg);

#elif defined (BOARD_RA4M1_EK) || defined (BOARD_RA2A1_EK)


#endif

	err = R_CGC_SystemClockGet(&g_cgc0_ctrl, &sys_clock_source, &sys_divider_cf);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}

	APP_PRINT("\r\nMCU Running with Clock Source = %s, \t", clk_to_string(sys_clock_source));
	switch (clk_currentState)
	{
		case ST_HOCO_NORM:
		{
			sys_clock_source = CGC_CLOCK_HOCO;
			sys_clk_cfg.hoco_state = CGC_CLOCK_CHANGE_START;
			break;
		}
		case ST_MOCO_NORM:
		{
			sys_clock_source = CGC_CLOCK_MOCO;
			sys_clk_cfg.moco_state = CGC_CLOCK_CHANGE_START;
			break;
		}
	    case ST_LOCO_NORM:
	    {
			sys_clock_source = CGC_CLOCK_LOCO;
			sys_clk_cfg.loco_state = CGC_CLOCK_CHANGE_START;
			sys_clk_cfg.divider_cfg.iclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.fclk_div = CGC_SYS_CLOCK_DIV_1;
			break;
	    }
		case ST_SOSC_NORM:
		{
			sys_clock_source = CGC_CLOCK_SUBCLOCK;
			sys_clk_cfg.divider_cfg.iclk_div = CGC_SYS_CLOCK_DIV_1;
			sys_clk_cfg.divider_cfg.fclk_div = CGC_SYS_CLOCK_DIV_1;
			break;
		}
		case ST_MOSC_NORM:
		{
			sys_clock_source = CGC_CLOCK_MAIN_OSC;
			sys_clk_cfg.mainosc_state = CGC_CLOCK_CHANGE_START;
			break;
		}
		case ST_CLK_NORM:
		default:
		{
			sys_clock_source = CGC_CLOCK_PLL;
			sys_clk_cfg.pll_state = CGC_CLOCK_CHANGE_NONE;
			break;
		}
	}

	sys_clk_cfg.system_clock = sys_clock_source;

	err = R_CGC_ClocksCfg(&g_cgc0_ctrl, &sys_clk_cfg);
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}

	APP_PRINT("Requested Clock Source for MCU = %s \r\n",clk_to_string(sys_clock_source));

	if (CGC_CLOCK_SUBCLOCK == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_SUBCLOCK;
		err = R_CGC_ClockStart(&g_cgc0_ctrl, CGC_CLOCK_SUBCLOCK, &new_clk);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
	else if (CGC_CLOCK_LOCO == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_LOCO;
		err = R_CGC_ClockStart(&g_cgc0_ctrl, CGC_CLOCK_LOCO, &new_clk);
		if (FSP_SUCCESS != err) {
			APP_ERR_TRAP(err);
		}
	}
	else if (CGC_CLOCK_MOCO == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_MOCO;
		err = R_CGC_ClockStart(&g_cgc0_ctrl, CGC_CLOCK_MOCO, &new_clk);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
	else if (CGC_CLOCK_HOCO == sys_clock_source)
	{
		new_clk.source_clock = CGC_CLOCK_HOCO;
		err = R_CGC_ClockStart(&g_cgc0_ctrl, CGC_CLOCK_HOCO, &new_clk);
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
	/* Clock  Oscillation Stabilization, wait for its stabilization by adding delay */
	R_BSP_SoftwareDelay(BSP_FEATURE_CGC_LOCO_STABILIZATION_MAX_US,BSP_DELAY_UNITS_MICROSECONDS);

	FSM_ACTION_PRINT
	read_and_print_rtc_time();
}

 /**********************************************************************************************************************
  * @brief       This function initiates the LPM Mode based on the state transition by FSM.
  *              When user/system event is triggered ("Button Press - Short"/timer), as part of the action this gets
  *              called.
  * @param[IN]   state: This is requested LPM state by the FSM code
  * @retval      None.
  **********************************************************************************************************************/
void execute_lpm(uint8_t state)
{
    fsp_err_t err = FSP_SUCCESS;

    PRE_FSM_ENTRY
	delay_500ms();

