renesas/ra-fsp-examples/application_projects/lpm_applications/RA6/Clock_change_and_lpm_EK_RA6M3/e2studio/src/lpm_app.c
	/* Disable IO port if it's not in Deep SW Standby mode */
	if (APP_LPM_DEEP_SW_STANDBY_STATE != g_lpm_transition_sequence[state])
	{
		/* Disable IO port before going to LPM mode*/
        err = R_IOPORT_PinsCfg(&g_ioport_ctrl, &g_bsp_pin_cfg);;
		/* Handle error */
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
	/* Open LPM instance*/
	err = R_LPM_Open(g_lpm_ctrl_instance_ctrls[state], g_lpm_ctrl_instance_cfgs[state]);
	/* Handle error */
	if (FSP_SUCCESS != err)
	{
		APP_ERR_TRAP(err);
	}

	/* Enter LPM mode */
    err = lpm_mode_enter(g_lpm_transition_sequence[state], g_lpm_ctrl_instance_ctrls[state]);
	/* Handle error */
	if (FSP_SUCCESS != err)
	{
		/* Turn on user LED to indicate error occurred*/
		R_IOPORT_PinWrite(&g_ioport_ctrl, leds->p_leds[LED_NO_0], BSP_IO_LEVEL_HIGH);
		APP_ERR_TRAP(err);
	}
	else
	{
		/* Close LPM instance.*/
		err = R_LPM_Close(g_lpm_ctrl_instance_ctrls[state]);
		/* Handle error */
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}

		/* Put IO port configuration back to user's selections */
		err = R_IOPORT_PinsCfg(&g_ioport_ctrl, &g_bsp_pin_cfg);

		/* Handle error */
		if (FSP_SUCCESS != err)
		{
			APP_ERR_TRAP(err);
		}
	}
}

/***********************************************************************************************************************
 * @brief       This function is a action to perform when user event is triggered in the Clock Mode (Button Press - Short).
 * @param[IN]   void
 * @retval      None.
  **********************************************************************************************************************/
 void enter_lpm_sm(void)
{
	 EXIT_CLOCK_FSM_ENTER_LPM_FSM
	 FSM_ACTION_PRINT
}

/**********************************************************************************************************************
 * @brief       This function initiates exit action from currently executing LPM state (Normal Mode)  to Clock State,
 *              when user event is triggered (Button Press - Long). T
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void exit_lpm_sm(void)
{
	EXIT_LPM_FSM_ENTER_CLOCK_FSM
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
	running_state_machine = CLK_SM;
}

/**********************************************************************************************************************
 * @brief       This function performs no LPM action, but covers the no action coverage of the FSM based on events.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void no_action(void)
{
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM Mode Transition: User Press button event triggers this action.
 *              Exits the Normal Mode and Prepares to enter the Sleep Mode.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_norm_exit_sleep_entry(void)
{
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
	execute_lpm(APP_LPM_SLEEP_STATE);
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM Mode Transition: User Press button event triggers this action.
 *              This gets called when Sleep mode is Exited and enters Normal Mode.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_sleep_exit_norm_entry(void)
{
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM Mode Transition: User Press button event triggers this action.
 *              Action performed: Exits the Normal Mode and Prepares to enter the Software Standby Mode.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_norm_exit_ssby_entry(void)
{
	read_and_print_rtc_time();
	set_rtc_calendar_alarm();
	FSM_ACTION_PRINT
	execute_lpm(APP_LPM_SW_STANDBY_STATE);
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM Mode Transition: User Press button event triggers this.
 *              Action performed: Exits the Normal Mode and Prepares to enter the Snooze Mode.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_norm_exit_snooze_entry(void)
{
	read_and_print_rtc_time();
	startPeriodicTimer();
	set_rtc_calendar_alarm();
	FSM_ACTION_PRINT
	execute_lpm(APP_LPM_SW_STANDBY_SNOOZE_STATE);
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM Mode Transition: User Press button event triggers this.
 *              Action performed: Exits the Normal Mode and Prepares to enter the Deep Software Standby Mode.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_norm_exit_deep_ssby_entry (void)
{
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
	execute_lpm(APP_LPM_DEEP_SW_STANDBY_STATE);
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM SM Transition based on event
 *              This is Just a place holder for the SM completeness. By the virtue of the Deep software standby mode,on
 *              interrupt the LPM mode of Deep software standby mode is exited and enters the Internal Reset Mode.
 *              So this is again not going to get executed. Just keeping it as a stub function.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_deep_ssby_exit_norm_entry (void)
{
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
}


/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM SM Transition based on the Timer event(RTC Alarm Interrupt).
 *              This is the action for the RTC Alarm generated event in the Software Standby Mode. This function performs
 *              the Post action of the Software Standby Mode exit.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_ssby_timer_action(void)
{
	stopPeriodicTimer();
	reset_rtc_calendar_alarm();
	delay_500ms();
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
}

/**********************************************************************************************************************
 * @brief       This function performs FSM action for LPM SM Transition based on the Timer event(RTC Alarm Interrupt).
 *              This is the action for the RTC Alarm generated event in the Snooze Mode. This function performs the Post
 *              action of the Snooze Mode exit.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void lpm_snz_timer_action(void)
{
	stopPeriodicTimer();
	reset_rtc_calendar_alarm();
	delay_500ms();
	read_and_print_rtc_time();
	FSM_ACTION_PRINT
}

/**********************************************************************************************************************
 * @brief       This function performs 500ms Delay using the BSP Software Delay API.
 * @param[IN]   void
 * @retval      None.
 **********************************************************************************************************************/
void delay_500ms()
{
	R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
}


/*******************************************************************************************************************//**
 * @brief       This function enables and puts the MCU in sleep mode.
 * @param[IN]   Requested LPM Mode and the pointer to it's instance
 * @retval      FSP_SUCCESS:    Upon successful entering sleep mode
 * @retval      Any Other Error code apart from FSP_SUCCESS
 **********************************************************************************************************************/
fsp_err_t lpm_mode_enter(app_lpm_states_t lpm_mode, lpm_instance_ctrl_t * const p_current_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    switch(lpm_mode)
    {
#if defined (BOARD_RA6M3_EK) || defined (BOARD_RA6M3G_EK) || defined (BOARD_RA6M2_EK) || defined (BOARD_RA6M1_EK)
        case APP_LPM_DEEP_SW_STANDBY_STATE:
            /* Enter Deep SW standby mode */
            err = R_LPM_LowPowerModeEnter(p_current_ctrl);
            break;
#endif
        case APP_LPM_SW_STANDBY_STATE:
            /* Enter SW Standby mode */
            err = R_LPM_LowPowerModeEnter(p_current_ctrl);
            break;

